Саракташ2/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>Анонимный</name>
      <description>Анонимный</description>
    </items>
  </predefined>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для неиностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочтенияВИзделиях</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТранспортнаяКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоТелефону</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресуЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Catalogs/Контрагенты/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоТранспортнаяКомпания") И Параметры.ЭтоТранспортнаяКомпания = Истина Тогда
		
		ОтборТранспортныеКомпании = Истина;
		Элементы.ГруппаОтборы.Видимость = Ложь;
		
	Иначе   	
		Если Параметры.Свойство("Опт") Тогда
			ОтборОпт = Параметры.Опт;
		КонецЕсли;
		
		Если Параметры.Свойство("Розница") Тогда
			ОтборРозница = Параметры.Розница;
		КонецЕсли;

		Если Параметры.Свойство("Покупатель") Тогда
			ОтборПокупатель = Параметры.Покупатель;
		КонецЕсли;

		Если Параметры.Свойство("Поставщик") Тогда
			ОтборПоставщик = Параметры.Поставщик;
		КонецЕсли;
		
		Если Параметры.Свойство("Служебный") Тогда
			ОтборСлужебные = Параметры.Служебный;
		КонецЕсли;  
		
		Если Не ОтборОпт И Не ОтборРозница Тогда
			ОтборРозница = Истина;
		КонецЕсли;
		
		Если Не ОтборПокупатель И Не ОтборПоставщик Тогда
			ОтборПокупатель = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	
	Если ОтборТранспортныеКомпании Тогда
		УстановитьОтбор("ЭтоТранспортнаяКомпания", Истина);
	Иначе
		УстановитьОтбор("ЭтоТранспортнаяКомпания", Ложь);	
		УстановитьОтбор("Опт", ОтборОпт);
		УстановитьОтбор("Розница", ОтборРозница);
		УстановитьОтбор("Покупатель", ОтборПокупатель);
		УстановитьОтбор("Поставщик", ОтборПоставщик);
		УстановитьОтбор("Служебный", ОтборСлужебные);  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ИмяПоля, ЗначениеПоля)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора = Неопределено;
	Для Каждого ЭлОтб Из Список.Отбор.Элементы Цикл
		Если ЭлОтб.ЛевоеЗначение = ПолеОтбора Тогда
			ЭлементОтбора = ЭлОтб;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ЗначениеПоля;			
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОптПриИзменении(Элемент)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОтбор()
	
КонецПроцедуры
